tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "readline"
brew "asdf"
brew "awscli"
brew "cmake"
brew "curl"
brew "direnv"
brew "tesseract"
brew "gcc"
brew "git"
brew "glow"
brew "gnupg"
brew "gobject-introspection"
brew "grip"
brew "jq"
brew "libgccjit"
brew "ocrmypdf"
brew "ossp-uuid"
brew "pinentry-mac"
brew "poppler"
brew "ripgrep"
brew "subversion"
brew "zlib"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-modern-papirus-icon", "with-native-comp", "with-poll", "with-xwidgets"]
cask "1password"
cask "bitwarden"
cask "docker"
cask "emacs"
cask "font-cascadia-mono"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fira-mono"
cask "font-inconsolata"
cask "font-roboto-mono"
cask "google-chrome"
cask "iterm2"
cask "licecap"
cask "livebook"
cask "ngrok"
cask "scroll-reverser"
cask "session-manager-plugin"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
