tap "d12frosted/emacs-plus"
tap "homebrew/bundle"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mhanberg/tap"
brew "webp"
brew "jpeg-xl"
brew "readline"
brew "asdf"
brew "awscli"
brew "freetype"
brew "cmake"
brew "curl"
brew "direnv"
brew "elixir-ls"
brew "harfbuzz"
brew "tesseract"
brew "gcc"
brew "gh"
brew "ghostscript"
brew "git"
brew "glow"
brew "gnupg"
brew "gobject-introspection"
brew "grip"
brew "imagemagick"
brew "jq"
brew "libgccjit"
brew "librsvg"
brew "pillow"
brew "ocrmypdf"
brew "openjdk@11"
brew "ossp-uuid"
brew "pandoc"
brew "pdfcpu"
brew "pdftk-java"
brew "pinentry-mac"
brew "poppler"
brew "python@3.10"
brew "ripgrep"
brew "rtx"
brew "starship"
brew "subversion"
brew "tree"
brew "tree-sitter"
brew "zlib"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-imagemagick", "with-modern-papirus-icon", "with-native-comp", "with-poll", "with-xwidgets"]
brew "mhanberg/tap/lazyasdf"
cask "1password"
cask "bitwarden"
cask "caffeine"
cask "docker"
cask "firefox"
cask "font-cascadia-mono"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-inconsolata"
cask "font-roboto-mono"
cask "font-victor-mono"
cask "google-chrome"
cask "iterm2"
cask "kap"
cask "keycastr"
cask "licecap"
cask "livebook"
cask "microsoft-teams"
cask "ngrok"
cask "notion"
cask "scroll-reverser"
cask "session-manager-plugin"
cask "spectacle"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "JakeBecker.elixir-ls"
vscode "mjmcloug.vscode-elixir"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "rebornix.ruby"
vscode "saratravi.elixir-formatter"
vscode "wingrunr21.vscode-ruby"
