# install with `brew bundle`

tap "d12frosted/emacs-plus"
brew "jpeg-xl"
brew "aom"
brew "autoconf"
brew "libtool"
brew "mise"
brew "bat"
brew "cmake"
brew "curl"
brew "direnv"
brew "enchant"
brew "git-delta"
brew "gnutls"
brew "tesseract"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "gnupg"
brew "gobject-introspection"
brew "grip"
brew "imagemagick"
brew "jq"
brew "k9s"
brew "libgccjit"
brew "libpq"
brew "librsvg"
brew "pillow"
brew "ossp-uuid"
brew "pandoc"
brew "pinentry-mac"
brew "poppler"
brew "ripgrep"
brew "rover"
brew "starship"
brew "tree"
brew "tree-sitter"
brew "d12frosted/emacs-plus/emacs-plus@30", args: ["with-imagemagick", "with-modern-papirus-icon", "with-xwidgets"]
cask "bitwarden"
cask "caffeine"
cask "docker"
cask "firefox"
cask "font-cascadia-mono"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-inconsolata"
cask "font-roboto-mono"
cask "font-victor-mono"
cask "font-iosevka-nerd-font"
cask "font-cascadia-mono"
cask "font-dejavu-sans-mono-for-powerline"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fira-mono-nerd-font"
cask "font-fira-sans"
cask "font-ibm-plex-sans"
cask "font-inconsolata"
cask "font-iosevka-aile"
cask "font-iosevka-etoile"
cask "font-iosevka-nerd-font"
cask "font-iosevka-term-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-kalam"
cask "font-roboto-mono"
cask "font-ubuntu-nerd-font"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
cask "iterm2"
cask "kap"
cask "keycastr"
cask "licecap"
cask "livebook"
cask "ngrok"
cask "notion"
cask "rectangle"
cask "raycast"
cask "session-manager-plugin"
cask "spotify"
cask "visual-studio-code"
